clear;clc;

%xyz轴空气阻力系数
k1 = 0.01;
k2 = 0.01;
k3 = 0.01;

%xyz轴旋转阻力系数
k4 = 0.012;
k5 = 0.012;
k6 = 0.012;

%转动惯量
Ixx = 1.25;
Iyy = 1.25;
Izz = 1.25;

g = 9.81;

%轴距
l = 0.2;

m = 2;

%pid参数
kp1 = 6;
kd1 = 5;

kp2 = 8;
kd2 = 4;

kp3 = 8;
kd3 = 4;

kp4 = 200;
kd4 = 40;

kp5 = 200;
kd5 = 40;

kp6 = 200;
kd6 = 40;

% kp4 = 6;
% kd4 = 5;
% 
% kp5 = 5;
% kd5 = 5;
% 
% kp6 = 5;
% kd6 = 5;

%跟踪积分器参数
% ksi_phi = 0.1;
% ksi_theta = 0.04;

ki1 = 0;
ki2 = 0;
ki3 = 0;
